/*----------------------客流分析-整体概述-----------------------*/
//折线图-近一周
(function () {

    var myChart = echarts.init(document.getElementById("week"));

    option = {
        title: {
            text: '近一周顾客趋势'
        },
        tooltip: {
            trigger: 'axis'
        },
        legend: {
            data: ['客流量', '入店量', '跳出量', '深访量']
        },
        grid: {
            left: '3%',
            right: '4%',
            bottom: '3%',
            containLabel: true
        },
        toolbox: {
            feature: {
                
            }
        },
        xAxis: {
            type: 'category',
            boundaryGap: false,
            data: ['2017/6/29', '2017/6/30', '2017/7/1', '2017/7/2', '2017/7/3', '2017/7/4', '2017/7/5']
        },
        yAxis: {
            type: 'value'
        },
        series: [
            {
                name: '客流量',
                type: 'line',

                data: [1920, 1769, 1753, 1425, 2013, 1523, 1323]
            },
            {
                name: '入店量',
                type: 'line',

                data: [530, 421, 362, 398, 357, 485, 321]
            },
            {
                name: '跳出量',
                type: 'line',

                data: [192,168, 170, 139, 189, 120, 137]
            },
            {
                name: '深访量',
                type: 'line',

                data: [1203, 1442, 1426, 1203, 1800, 1320, 1111]
            }
        ]
    };

    myChart.setOption(option);
})();



//折线图-近30天
(function () {

    var area = echarts.init(document.getElementById("month"));

    option = {
        title: {
            text: '近一月顾客趋势'
        },
        tooltip: {
            trigger: 'axis'
        },
        legend: {
             data: ['客流量', '入店量', '跳出量', '深访量']
        },
        toolbox: {
            feature: {
                
            }
        },
        grid: {
            left: '3%',
            right: '4%',
            bottom: '3%',
            containLabel: true
        },
        xAxis: [
            {
                type: 'category',
                boundaryGap: false,
                data: ['2017/6/7', '2017/6/8', '2017/6/9', '2017/6/10',
                 '2017/6/11', '2017/6/12', '2017/6/13', '2017/6/14', '2017/6/15',
                  '2017/6/16', '2017/6/17', '2017/6/18', '2017/6/19', '2017/6/20', 
                  '2017/6/21', '2017/6/22', '2017/6/23', '2017/6/24', '2017/6/25', 
                  '2017/6/26', '2017/6/27', '2017/6/28', '2017/6/29', '2017/6/30',
                   '2017/6/30', '2017/7/1', '2017/7/2', '2017/7/3', '2017/7/4', '2017/7/5' ]
            }
        ],
        yAxis: [
            {
                type: 'value'
            }
        ],
        series: [
            {
                name: '客流量',
                type: 'line',
 
                data: [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                    1752.1765,1842,
                    1920, 1769, 1753, 1425, 2013, 1523, 1323]
            },
            {
                name: '入店量',
                type: 'line',

                data: [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                    485, 499, 521,
                    530, 421,362, 398, 357, 485, 321]
            },
            {
                name: '跳出量',
                type: 'line',

                data: [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                    156,178,180,
                    192,168, 170, 139, 189, 120, 137]
            },
            {
                name: '深访量',
                type: 'line',

                data: [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                    1001,1056,1118,
                    1203, 1442, 1426, 1203, 1800, 1320, 1111]
            }
        ]
    };

    area.setOption(option);
})();

